keyboards = {
    'menu_keyboard': {
        'add_operation': 'Добавить операцию',
        'last_operations': 'Последние операции',
        'profile': 'Профиль',
        'settings': 'Настройки'
    }
}

commands = {
    'start_command_text': 'Добро пожаловать в Finance Bot 💲\n\n'
                          'Этот бот поможет вести учёт расходов. '
                          'Вы можете классифицировать все операции по категориям, '
                          'просматривать последние операции и формировать отчёт за определённый период.\n\n'
                          'Для получения дополнительной информации напишите команду "/help."',
    'help_command_text': 'Список основных функций бота:\n\n'
                         '1. <b>Добавить операцию</b> - Позволяет добавить операцию с последующим выбором категории и суммы.\n\n'
                         '2. <b>Последние операции</b> - Отображает последние 5 операций.\n\n'
                         '3. <b>Профиль</b> - Отображает вашу статистику по всем категориям.\n\n'
                         '4. <b>Настройки</b> - Дополнительные функции.'
}